<!-- dflook/terraform-github-actions {"workspace":"tvm-ci-prod","backend":"fe7130d32830ee0d0082204cb3c4e5f52fc1dd92a483924840f2d1374cee687c","backend_type":"s3"} -->
Terraform plan in __./terraform__ in the __tvm-ci-prod__ workspace
With var files: `terraform/vars/tvm-ci-prod.auto.tfvars
`
<details>
<summary>Plan: 0 to add, 13 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # aws_lambda_function.tvm_bot_lambda will be updated in-place
  ~ resource "aws_lambda_function" "tvm_bot_lambda" {
      ~ handler                        = "tvm_bot_lambda_function.lambda_handler" -> "lambda_function.lambda_handler"
        id                             = "tvm_bot"
      ~ last_modified                  = "2022-12-09T22:34:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "S6c2bddV94i6tPznWep4ZIIs4TTrSw/4h4bF/mm1mDE=" -> "EjM2ZL1+LlDYjAAutV4wb3Yt1+2odEgiveHzlGYUtDM="
        tags                           = {}
        # (23 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.artifacts-bucket will be updated in-place
  ~ resource "aws_s3_bucket" "artifacts-bucket" {
        id                          = "tvm-jenkins-artifacts-prod"
        tags                        = {
            "Name" = "tvm-jenkins-artifacts-prod"
        }
        # (10 unchanged attributes hidden)

      + logging {
          + target_bucket = "bucket-access-logs-tvm-ci-prod"
          + target_prefix = "log/"
        }

        # (2 unchanged blocks hidden)
    }

  # aws_s3_bucket.bucket will be updated in-place
  ~ resource "aws_s3_bucket" "bucket" {
        id                          = "tvm-sccache-prod"
        tags                        = {
            "Name" = "tvm-sccache-prod"
        }
        # (10 unchanged attributes hidden)

      + logging {
          + target_bucket = "bucket-access-logs-tvm-ci-prod"
          + target_prefix = "log/"
        }

        # (1 unchanged block hidden)
    }

  # aws_s3_bucket.vendor_ci_bucket will be destroyed
  # (because aws_s3_bucket.vendor_ci_bucket is not in configuration)
  - resource "aws_s3_bucket" "vendor_ci_bucket" {
      - acl                         = "private" -> null
      - arn                         = "arn:aws:s3:::tvm-vendor-ci-prod" -> null
      - bucket                      = "tvm-vendor-ci-prod" -> null
      - bucket_domain_name          = "tvm-vendor-ci-prod.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "tvm-vendor-ci-prod.s3.us-west-2.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z3BJ6K6RIION7M" -> null
      - id                          = "tvm-vendor-ci-prod" -> null
      - region                      = "us-west-2" -> null
      - request_payer               = "BucketOwner" -> null
      - tags                        = {
          - "Name" = "tvm-vendor-ci-prod"
        } -> null
      - tags_all                    = {
          - "Name" = "tvm-vendor-ci-prod"
        } -> null

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-ARM"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-ARM"
        name                      = "Prod-Autoscaler-Jenkins-ARM"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "26" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-ARM"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-0307dda3ecfec7907"
      ~ image_id                = "************************************************"
      ~ latest_version          = 26 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-ARM20220125202831343700000004"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-ARM-Small"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-ARM-Small"
        name                      = "Prod-Autoscaler-Jenkins-ARM-Small"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "17" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-ARM-Small"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-0eb9ed056278d5a50"
      ~ image_id                = "************************************************"
      ~ latest_version          = 17 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-ARM-Small20220524173817984800000001"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-CPU"
        name                      = "Prod-Autoscaler-Jenkins-CPU"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "27" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-084b74d77c2ee9ba2"
      ~ image_id                = "************************************************"
      ~ latest_version          = 27 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-CPU20220125202831342000000001"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU-Small"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-CPU-Small"
        name                      = "Prod-Autoscaler-Jenkins-CPU-Small"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "20" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-CPU-Small"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-02518d53b22a85dd8"
      ~ image_id                = "************************************************"
      ~ latest_version          = 20 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-CPU-Small20220425184607394500000002"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-GPU"].aws_autoscaling_group.agents will be updated in-place
  ~ resource "aws_autoscaling_group" "agents" {
        id                        = "Prod-Autoscaler-Jenkins-GPU"
        name                      = "Prod-Autoscaler-Jenkins-GPU"
        # (22 unchanged attributes hidden)

      ~ mixed_instances_policy {

          ~ launch_template {
              ~ launch_template_specification {
                  ~ version              = "23" -> (known after apply)
                    # (2 unchanged attributes hidden)
                }
            }

            # (1 unchanged block hidden)
        }
    }

  # module.Jenkins-Autoscalers["Prod-Autoscaler-Jenkins-GPU"].aws_launch_template.autoscaler will be updated in-place
  ~ resource "aws_launch_template" "autoscaler" {
        id                      = "lt-0f6765aeec1cbbc77"
      ~ image_id                = "************************************************"
      ~ latest_version          = 23 -> (known after apply)
        name                    = "Prod-Autoscaler-Jenkins-GPU20220125202831343600000003"
        tags                    = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

Plan: 0 to add, 13 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [terraform plan #113](https://github.com/tlc-pack/ci/actions/runs/3876513103)